app/controllers/users_controller.rb

    def set_user
      @user = User.find(params[:user])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]